[
    {
      "id": 1,
      "title": "Camisa Retrô Flamengo I 1995 Centenário - Torcedor Masculina - Vermelha e Preta",
      "description": "A camisa principal utilizada pelo time naquela temporada tinha como base o tradicional vermelho e preto, com uma faixa horizontal na altura do peito em tom mais claro de vermelho, em um design simples e elegante. O patrocinador da época, a Lubrax, estampava sua marca no centro da camisa.",
      "price": "R$ 189,99",
      "image": "https://images.tcdn.com.br/img/img_prod/1052037/camisa_flamengo_retro_1995_205_1_2bf4cf4e8b5d41fb73709e8ec4343a8e.jpg"
    },
    {
      "id": 2,
      "title": "Camisa Retrô Flamengo I 1992/93 - Torcedor Masculina - Vermelho e Preto",
      "description": "A Camisa Retrô do Flamengo I 1992/93 é a escolha perfeita para os torcedores apaixonados pelo Mengão. Com as icônicas cores vermelho e preto, a camisa celebra a época em que o lendário Júnior, ídolo rubro-negro, vestiu a camisa do time. Essa foi a última camisa utilizada pelo ídolo rubro-negro. Produzida pela Umbro, a camisa retrô apresenta um tecido macio e confortável, além de um corte moderno e atual. Não perca a chance de celebrar as glórias do seu time com essa camisa retrô exclusiva!",
      "price": "R$ 219,99",
      "image": "https://acdn.mitiendanube.com/stores/001/040/596/products/df3a98c5-removebg-preview1-1167709b161315bd1116523739860982-um640-0.png"
    },
    {
      "id": 3,
      "title": "Camisa Retrô Flamengo I 2008/09 - Torcedor Nike Masculina - Vermelha e Preta",
      "description": "A Camisa Retrô Flamengo I 2008 é uma grande lembrança da camisa icônica de Adriano Imperador. Com design em vermelho e preto, a camisa é um clássico para todo torcedor do Mengão. Fabricada pela Nike, essa camisa retrô traz todo o estilo e qualidade que a marca oferece. O modelo apresenta gola em V com detalhes em dourado e a combinação de cores é aplicada em faixas horizontais que percorrem toda a peça. Não deixe de adquirir a sua Camisa Retrô Flamengo I 2008 e reviver as emoções daquele ano!",
      "price": "R$ 150,00",
      "image": "https://acdn.mitiendanube.com/stores/001/040/596/products/539f3ceb-removebg-preview1-2df1096867479e0a3c16523836472478-640-0.png"
    },
    {
      "id": 4,
      "title": "Camisa Retrô Flamengo I 1995 Centenário Papagaio-vintém - Torcedor Masculina - Vermelho e Preto",
      "description": "A camisa apresentava quatro grandes quadrados em preto e vermelho. Esse design ousado e vibrante fez com que a camisa se tornasse uma das mais icônicas na história do Flamengo e do futebol brasileiro. Além disso, a camisa papagaio-vintém foi usada por grandes jogadores do Flamengo daquela época, como Romário, Sávio, Júnior Baiano e Edmundo, e é lembrada como um símbolo da tradição e paixão da torcida rubro-negra.",
      "price": "R$ 219,00",
      "image": "https://d3ugyf2ht6aenh.cloudfront.net/stores/001/562/869/products/flamengo_third_1995-96-removebg-preview1-82b4dea8401c782b4e16748488286108-640-0.webp"
    },
    {
      "id": 5,
      "title": "Camisa Retrô Flamengo Mundial 81 Zico",
      "description": "A história recomeça com você. Essa camisa é um manto sagrado, alusiva a conquista do Mundial de Clubes de 1981, considerada a melhor equipe rubro-negra de todos os tempos, ainda foi campeão carioca e da Libertadores desse mesmo ano. O dono da camisa 10 é o maior ídolo da nação rubro negra, Zico.",
      "price": "R$ 200,00",
      "image": "https://static.netshoes.com.br/produtos/camisa-flamengo-zico-retro/14/D40-4426-014/D40-4426-014_zoom1.jpg?ts=1691187730&ims=544x"
    },
    {
      "id": 6,
      "title": "Camisa Flamengo 1981",
      "description": "O ano de 1981 foi mágico para o Mengão. O timaço recheado de craques e ídolos era comandado em campo pelo maior de todos: ZICO. O Flamengo conquistou a Libertadores e o Mundial de 81. Manto retrô oficial do Flamengo, confeccionado em algodão, com o autógrafo do Galinho bordado, além do símbolo e do número 10 em veludo.",
      "price": "R$ 210,00",
      "image": "https://static3.tcdn.com.br/img/img_prod/311840/camisa_flamengo_andrade_51011_2_20210806214018.jpg"
    },
    {
      "id": 7,
      "title": "Camisa Flamengo 2011",
      "description": "\"Já imagino essa torcida no estádio lotado. Eles podem esperar o máximo de mim. Voltei para o Brasil e vim jogar no Flamengo para dar isso\". Após quase uma década, um dos maiores ídolos do futebol mundial está de volta ao país que o viu nascer e que o consagrou para a eternidade. Agora, Ronaldinho Gaúcho está de volta, e no clube da maior e mais apaixonada torcida do Brasil: o Flamengo.",
      "price": "R$ 110,00",
      "image": "https://blogger.googleusercontent.com/img/a/AVvXsEheWuFP49e3VWbbYuN5mAR_az_q809u6MN4Tb2e6dQe4w06FvFX2cwtYyGKTxlnK_NMuvk01nZ8FadR5kdnNnMDoQ5TSdpN-OfHQqoHRijdRfj2J2wAivzdS-fELmU7fFA9RMyy5oY9uCVHaguupfam4ptZxkVn-M6tIcCKJ7DAFodAuiuPzVgtUeUC=s320"
    },
    {
      "id": 8,
      "title": "Camisa Retrô Flamengo I 2000/01 - Torcedor Masculina - Vermelho e preto",
      "description": "A camisa retrô do Flamengo de 2000/01 é uma peça única que todo torcedor rubro-negro precisa ter em sua coleção. Com suas cores vermelho e preto clássicas, a camisa masculina é uma réplica da utilizada pelos jogadores na conquista do tricampeonato carioca em 2001, sendo lembrada especialmente pelo gol de falta histórico de Petkovic no clássico contra o Vasco.",
      "price": "R$ 100,00",
      "image": "https://2.bp.blogspot.com/-DBd64jRJvPg/Ug2qz104JsI/AAAAAAAAALI/oNYJmtSvuOk/s1600/Flamengo+2001.png"
    },
    {
      "id": 9,
      "title": "Camisa Retrô Flamengo I 2019 - Torcedor Adidas Masculina - Vermelho e Preto",
      "description": "Se você é um torcedor fanático do Flamengo e ama o estilo retrô, esta camisa é para você! Inspirada no modelo utilizado pelo time em 2019/2020, esta camisa retrô traz o tradicional vermelho e preto do Flamengo em um design vintage que remete às glórias de 2019. Além de contar com um material de alta qualidade e conforto, esta camisa retrô possui o escudo do time bordado no peito, destacando ainda mais a sua paixão pelo Mengão. Não perca a chance de ter essa relíquia em sua coleção e reviver grandes momentos da história do Flamengo!",
      "price": "R$ 190,00",
      "image": "https://acdn.mitiendanube.com/stores/002/183/167/products/camisa-flamengo-retro-2019-i-rubro-negra-adidas-21-5fddc243343edd4e9316709839131841-480-0.png"
    }
  ]  